Diplom_5/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_НачисленияЗП</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom_5/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom_5/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom_5/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВКМ_Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ВКМ_Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Diplom_5/src/Documents/ВКМ_НачисленияЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецМесяца(Объект.Дата);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ВКМ_НачисленияЗП.Очистить();
	
	Дата = Объект.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК ВКМ_ОбслуживаниеКлиента
		|ПОМЕСТИТЬ ВТ_ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ГОД(ВКМ_ОбслуживаниеКлиента.Дата) = ГОД(&Дата)
		|	И МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(&Дата)
		|	И ВКМ_ОбслуживаниеКлиента.Проведен
		|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ДанныеОтпусков
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	(МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаНачала) = МЕСЯЦ(&Дата)
		|				И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаНачала) = ГОД(&Дата)
		|			ИЛИ МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаОкончания) = МЕСЯЦ(&Дата)
		|				И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ВКМ_ДатаОкончания) = ГОД(&Дата))
		|	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад КАК ВКМ_Оклад,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ВКМ_ДатаНачала, НЕОПРЕДЕЛЕНО) КАК ВКМ_ДатаНачалаОтпуска,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ВКМ_ДатаОкончания, НЕОПРЕДЕЛЕНО) КАК ВКМ_ДатаОкончанияОтпуска,
		|	ЕСТЬNULL(ВТ_ПроцентОтРабот.ВКМ_ОбслуживаниеКлиента, НЕОПРЕДЕЛЕНО) КАК ВыполненныеРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентОтРабот КАК ВТ_ПроцентОтРабот
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник = ВТ_ПроцентОтРабот.ВКМ_Специалист
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтпусков КАК ВТ_ДанныеОтпусков
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник = ВТ_ДанныеОтпусков.ВКМ_Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Оклад
		СтрокаТЧ = Объект.ВКМ_НачисленияЗП.Добавить();
		СтрокаТЧ.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник;
		СтрокаТЧ.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
		СтрокаТЧ.ВКМ_ДатаНачало = НачалоМесяца(Дата);
		СтрокаТЧ.ВКМ_ДатаОкончание = КонецМесяца(Дата);
		СтрокаТЧ.ВКМ_ГрафикРаботы = Объект.ВКМ_ГрафикРаботы;
		
		Если ЗначениеЗаполнено(Выборка.ВыполненныеРаботы) Тогда
			СтрокаТЧ = Объект.ВКМ_НачисленияЗП.Добавить();
			СтрокаТЧ.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник;
			СтрокаТЧ.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПроцентОтРабот;
			СтрокаТЧ.ВКМ_ДатаНачало = НачалоМесяца(Дата);
			СтрокаТЧ.ВКМ_ДатаОкончание = КонецМесяца(Дата);
			СтрокаТЧ.ВКМ_ГрафикРаботы = Объект.ВКМ_ГрафикРаботы;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ВКМ_ДатаНачалаОтпуска) Тогда
			
			СтрокаТЧ = Объект.ВКМ_НачисленияЗП.Добавить();
			СтрокаТЧ.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник;
			СтрокаТЧ.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;
			СтрокаТЧ.ВКМ_ГрафикРаботы = Объект.ВКМ_ГрафикРаботы;
			
			Если Месяц(Дата) = Месяц(Выборка.ВКМ_ДатаНачалаОтпуска) Тогда
				СтрокаТЧ.ВКМ_ДатаНачало = Выборка.ВКМ_ДатаНачалаОтпуска;
			Иначе
				СтрокаТЧ.ВКМ_ДатаНачало = НачалоМесяца(Дата);
			КонецЕсли;
			
			Если Месяц(Дата) = Месяц(Выборка.ВКМ_ДатаОкончанияОтпуска) Тогда
				СтрокаТЧ.ВКМ_ДатаОкончание = Выборка.ВКМ_ДатаОкончанияОтпуска;
			Иначе
				СтрокаТЧ.ВКМ_ДатаОкончание = КонецМесяца(Дата);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
